backend/controllers/EnterpriseUserController.php

UPDATE `hhqy_enterprise_user` SET `status2`='1' WHERE `id`='54'
---
    public function actionStatus2($id){
        $enterprise = EnterpriseUserAdmin::find(['status2'])->where(['id'=>$id])->one();
        if($enterprise->status2 == 2){
            $enterprise->status2 = 1;
            $enterprise->save();